task-gt/task-c/openfoam/task-14/init_file/snappy_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam; // TODO_SOLVER

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500; // TODO_END_TIME

deltaT          1; // TODO_DELTA_T

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1; // TODO_MAX_CO
maxAlphaCo      1; // TODO_MAX_ALPHA_CO

maxDeltaT       1;

// ************************************************************************* //
