task-gt/task-c/openfoam/task-14/init_file/snappy_base/system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (0 0 -0.005)
    (2 0 -0.005)
    (2 1 -0.005)
    (0 1 -0.005)
    (0 0 0.005)
    (2 0 0.005)
    (2 1 0.005)
    (0 1 0.005)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (160 80 1) simpleGrading (1 1 1) // TODO_BACKGROUND_MESH
);
boundary
(
    inlet  { type patch; faces ((0 3 7 4)); }
    outlet { type patch; faces ((1 5 6 2)); }
    walls
    {
        type wall;
        faces ((0 4 5 1) (3 2 6 7));
    }
    frontAndBack
    {
        type empty;
        faces ((0 1 2 3) (4 7 6 5));
    }
);
