task-gt/task-c/openfoam/task-14/init_file/snappy_base/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy pipe surface from resources directory
mkdir -p constant/geometry
cp $FOAM_TUTORIALS/resources/geometry/pipe*.obj.gz constant/geometry/

runApplication surfaceFeatures
runApplication blockMesh
runApplication snappyHexMesh -overwrite

#------------------------------------------------------------------------------
